app/Controllers/Home.php

    public function registerUserInDataBase()
    {
        $username = $this->request->getPost('username');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $data = [
            'nome' => $username,
            'email' => $email,
            'password' => password_hash($password, PASSWORD_BCRYPT),
        ];
        $users_model = new UsersModel();
        if($users_model->save($data)){
---
INSERT INTO `users` (`nome`, `email`, `password`) VALUES ('adm@adm.org', 'adm@adm.org', '$2y$10$EEdZkWFKCeNfD5ljggl5GO1owIg1Is9g.wsqVjLSzrGvZ8QBPvSv.')

    public function loginUser(){
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');


        $users_model = new UsersModel();
        $user = $users_model->where('nome', $username)->first();
---
SELECT *
FROM `users`
WHERE `nome` = 'adm@adm.org'
 LIMIT 1

    public function enterMyHome(): string
    {
        $userId = $this->session->get('user_id');
        $produtosModel = new ProdutosModel();
        $data['produtos_do_usuario'] = $produtosModel->where('id_usuario', $userId)->findAll();
---
SELECT *
FROM `produtos`
WHERE `id_usuario` IS NULL